<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport"
          content="width=device-width, user-scalable=no, initial-scale=1.0, maximum-scale=1.0, minimum-scale=1.0">
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <script src="https://code.jquery.com/jquery-3.7.1.min.js" integrity="sha256-/JqT3SQfawRcv/BIHPThkBvs0OEvtFFmqPF/lYI/Cxo=" crossorigin="anonymous"></script>
    <link rel="icon" type="image/x-icon" href="{{ asset("images/favicon.ico") }}">
    <link rel="stylesheet" type="text/css" href="{{ asset("css/index.css") }}">
    <link rel="stylesheet" type="text/css" href="{{ asset("css/logreg.css") }}">
{{--    @if (Route::is('register') || Route::is('login'))--}}
{{--        <link rel="stylesheet" type="text/css" href="{{ asset("css/logreg.css") }}">--}}
{{--    @endif--}}
    @if (Route::is('profile'))
        <link rel="stylesheet" type="text/css" href="{{ asset("css/profile.css") }}">
    @endif
    @if (Route::is('messages'))
        <link rel="stylesheet" type="text/css" href="{{ asset("css/messages.css") }}">
    @endif
    @if (Route::is('sections'))
        <link rel="stylesheet" type="text/css" href="{{ asset("css/sections.css") }}">
    @endif
    @if (Route::is('sales') || Route::is('purchases'))
        <link rel="stylesheet" type="text/css" href="{{ asset("css/sales_purchases.css") }}">
    @endif
    @if (Route::is('list'))
        <link rel="stylesheet" type="text/css" href="{{ asset("css/list.css") }}">
    @endif
    @if (Route::is('edit'))
        <link rel="stylesheet" type="text/css" href="{{ asset("css/edit.css") }}">
    @endif
    <title>@yield('title')</title>
</head>
<body>
<!-- IF USER IS AUTHORIZED -->
@if (!empty(request()->cookie('USER')))
<header>
    <div class="header">
        <section class="left">
            <a class="logo__link" href="{{ url("/") }}">
                <img class="logo" src="{{ asset("images/logo.svg") }}" alt="logo">
            </a>
            <input class="search__products" type="text" placeholder="Поиск">
            <svg class="search__icon" xmlns="http://www.w3.org/2000/svg" width="13" height="13" viewBox="0 0 13 13" fill="none">
                <path d="M12.4398 13L7.47085 8.03168C7.0741 8.36967 6.61784 8.63123 6.10206 8.81636C5.58628 9.00149 5.06785 9.09405 4.54679 9.09405C3.27612 9.09405 2.20066 8.65424 1.32039 7.77461C0.440131 6.89446 0 5.81939 0 4.54941C0 3.27942 0.439602 2.20382 1.31881 1.32261C2.19854 0.440871 3.27347 0 4.54361 0C5.81428 0 6.89027 0.440077 7.77159 1.32023C8.65291 2.20039 9.09357 3.27598 9.09357 4.54703C9.09357 5.09818 8.99597 5.63162 8.80077 6.14733C8.60504 6.66305 8.34847 7.10418 8.03107 7.47074L13 12.4383L12.439 13H12.4398ZM4.54679 8.29985C5.5995 8.29985 6.48849 7.93752 7.21376 7.21288C7.93849 6.48823 8.30086 5.59935 8.30086 4.54623C8.30086 3.49364 7.93849 2.60503 7.21376 1.88038C6.48902 1.15573 5.6003 0.793409 4.54758 0.793409C3.49486 0.793409 2.60587 1.15573 1.88061 1.88038C1.15587 2.60503 0.793505 3.49364 0.793505 4.54623C0.793505 5.59882 1.15587 6.48744 1.88061 7.21209C2.60534 7.93673 3.49407 8.29985 4.54679 8.29985Z" fill="#787878"/>
            </svg>
        </section>
        <section class="right">
            <a class="header__link" id="selected" href="{{ url("/messages") }}">Сообщения</a>
            <a class="header__link" href="{{ url("/sales") }}">Продажи</a>
            <a class="header__link" href="{{ url("/purchases") }}">Покупки</a>
            <div class="profile__container" id="profile">
                <!-- EDIT EDIT EDIT -->
                <a class="profile__link" href="#">
                    <img style="width: 39px; height: 39px;" src="{{ asset($user->avatar) }}" alt="avatar">
                </a>
{{--                <svg xmlns="http://www.w3.org/2000/svg" width="39" height="39" viewBox="0 0 39 39" fill="none">--}}
{{--                    <circle cx="19.5" cy="19.5" r="19.5" fill="#D9D9D9"/>--}}
{{--                </svg>--}}
                <svg style="margin-left: 5px;" xmlns="http://www.w3.org/2000/svg" width="10" height="7" viewBox="0 0 10 7" fill="none">
                    <path d="M0.458596 -8.10623e-06H8.7086C8.79212 0.000253677 8.874 0.0232911 8.94541 0.0666237C9.01682 0.109956 9.07505 0.171942 9.11385 0.245912C9.15265 0.319881 9.17054 0.403032 9.1656 0.486413C9.16066 0.569795 9.13307 0.650249 9.0858 0.719117L4.9608 6.67745C4.78985 6.92449 4.37826 6.92449 4.20685 6.67745L0.0818463 0.719117C0.0340993 0.650393 0.00609945 0.569898 0.000888674 0.486378C-0.0043221 0.402858 0.0134556 0.319507 0.0522902 0.24538C0.0911248 0.171255 0.149531 0.109189 0.221163 0.0659261C0.292795 0.0226641 0.374914 -0.000139713 0.458596 -8.10623e-06Z" fill="white"/>
                </svg>
            </div>
            <div class="profile__subtable hidden" id="subtable">
                <div class="link__container">
                    <a class="subtable__link" href="{{ url("/profile") }}">Профиль</a>
                    <a class="subtable__link" href="{{ url("/settings")  }}">Настройки</a>
                    <a class="subtable__link" href="#">Кошелёк</a>
                    <a class="subtable__link" href="#">Валюта</a>
                    <a class="subtable__link" href="#">Язык</a>
                </div>
                <a class="logout__button" href="{{ url("/logout") }}">Выйти с аккаунта</a>
            </div>
        </section>
    </div>
</header>
@else
<!-- IF USER IS NOT AUTHORIZED -->
<header>
    <div class="header">
        <section class="left">
            <a class="logo__link" href="{{ url("/") }}">
                <img class="logo" src="{{ asset("images/logo.svg") }}" alt="logo">
            </a>
            <input class="search__products" type="text" placeholder="Поиск">
            <svg class="search__icon" xmlns="http://www.w3.org/2000/svg" width="13" height="13" viewBox="0 0 13 13" fill="none">
                <path d="M12.4398 13L7.47085 8.03168C7.0741 8.36967 6.61784 8.63123 6.10206 8.81636C5.58628 9.00149 5.06785 9.09405 4.54679 9.09405C3.27612 9.09405 2.20066 8.65424 1.32039 7.77461C0.440131 6.89446 0 5.81939 0 4.54941C0 3.27942 0.439602 2.20382 1.31881 1.32261C2.19854 0.440871 3.27347 0 4.54361 0C5.81428 0 6.89027 0.440077 7.77159 1.32023C8.65291 2.20039 9.09357 3.27598 9.09357 4.54703C9.09357 5.09818 8.99597 5.63162 8.80077 6.14733C8.60504 6.66305 8.34847 7.10418 8.03107 7.47074L13 12.4383L12.439 13H12.4398ZM4.54679 8.29985C5.5995 8.29985 6.48849 7.93752 7.21376 7.21288C7.93849 6.48823 8.30086 5.59935 8.30086 4.54623C8.30086 3.49364 7.93849 2.60503 7.21376 1.88038C6.48902 1.15573 5.6003 0.793409 4.54758 0.793409C3.49486 0.793409 2.60587 1.15573 1.88061 1.88038C1.15587 2.60503 0.793505 3.49364 0.793505 4.54623C0.793505 5.59882 1.15587 6.48744 1.88061 7.21209C2.60534 7.93673 3.49407 8.29985 4.54679 8.29985Z" fill="#787878"/>
            </svg>
        </section>
        <section class="right">
            <a class="header__link" href="{{ url("/register") }}">Зарегистрироваться</a>
            <a class="header__link" href="{{ url("/login") }}">Войти</a>
        </section>
    </div>
</header>
@endif
@yield('main_content')
<footer>
    <div class="footer">
        <h5 class="title">2024-3024 MazPay</h5>
        <div class="links">
            <a class="link" href="#">Политика конфиденциальности</a>
            <a class="link" href="#">Политика cookie</a>
            <a class="link" href="#">Отправить запрос</a>
        </div>
        <div class="social">
            <a class="social__link" href="#">
                <svg xmlns="http://www.w3.org/2000/svg" width="46" height="46" viewBox="0 0 46 46" fill="none">
                    <path d="M22.9167 0C10.2667 0 0 10.2667 0 22.9167C0 35.5667 10.2667 45.8333 22.9167 45.8333C35.5667 45.8333 45.8333 35.5667 45.8333 22.9167C45.8333 10.2667 35.5667 0 22.9167 0ZM33.55 15.5833C33.2062 19.2042 31.7167 28.0042 30.9604 32.0604C30.6396 33.7792 29.9979 34.3521 29.4021 34.4208C28.0729 34.5354 27.0646 33.55 25.7812 32.7021C23.7646 31.3729 22.6187 30.5479 20.6708 29.2646C18.4021 27.775 19.8687 26.95 21.175 25.6208C21.5187 25.2771 27.3854 19.9375 27.5 19.4562C27.5159 19.3834 27.5138 19.3077 27.4938 19.2358C27.4739 19.1639 27.4366 19.098 27.3854 19.0437C27.2479 18.9292 27.0646 18.975 26.9042 18.9979C26.6979 19.0437 23.4896 21.175 17.2333 25.3917C16.3167 26.0104 15.4917 26.3312 14.7583 26.3083C13.9333 26.2854 12.375 25.85 11.2062 25.4604C9.7625 25.0021 8.63958 24.75 8.73125 23.9479C8.77708 23.5354 9.35 23.1229 10.4271 22.6875C17.1187 19.7771 21.5646 17.8521 23.7875 16.9354C30.1583 14.2771 31.4646 13.8187 32.3354 13.8187C32.5187 13.8187 32.9542 13.8646 33.2292 14.0937C33.4583 14.2771 33.5271 14.5292 33.55 14.7125C33.5271 14.85 33.5729 15.2625 33.55 15.5833Z" fill="white"/>
                </svg>
            </a>
            <a class="social__link" href="#">
                <svg xmlns="http://www.w3.org/2000/svg" width="46" height="46" viewBox="0 0 46 46" fill="none">
                    <path d="M26.8405 22.5999L21.4595 20.0891C20.9899 19.871 20.6042 20.1154 20.6042 20.6353V25.3647C20.6042 25.8846 20.9899 26.129 21.4595 25.9109L26.8381 23.4001C27.3101 23.1797 27.3101 22.8203 26.8405 22.5999ZM23 0C10.2973 0 0 10.2973 0 23C0 35.7027 10.2973 46 23 46C35.7027 46 46 35.7027 46 23C46 10.2973 35.7027 0 23 0ZM23 32.3438C11.2269 32.3438 11.0208 31.2824 11.0208 23C11.0208 14.7176 11.2269 13.6562 23 13.6562C34.7731 13.6562 34.9792 14.7176 34.9792 23C34.9792 31.2824 34.7731 32.3438 23 32.3438Z" fill="white"/>
                </svg>
            </a><a class="social__link" href="#">
                <svg xmlns="http://www.w3.org/2000/svg" width="46" height="52" viewBox="0 0 45 52" fill="none">
                    <path d="M29.8507 24.7C29.8087 25.2161 29.6188 25.7086 29.3044 26.1174C28.99 26.5261 28.5646 26.8334 28.0803 27.0016C27.5959 27.1698 27.0736 27.1917 26.5771 27.0646C26.0807 26.9375 25.6316 26.6669 25.2848 26.2859C24.938 25.9049 24.7084 25.4299 24.6243 24.9191C24.5401 24.4083 24.6049 23.8838 24.8109 23.4097C25.0168 22.9355 25.3548 22.5323 25.7837 22.2493C26.2126 21.9663 26.7137 21.8158 27.2258 21.8162C28.6894 21.879 29.8507 23.0945 29.8507 24.583L29.8486 24.7043V24.6978L29.8507 24.7ZM17.8427 21.8183C17.1324 21.8852 16.4722 22.2175 15.9912 22.7503C15.5101 23.283 15.2429 23.978 15.2415 24.6994C15.2402 25.4208 15.5049 26.1168 15.9839 26.6514C16.463 27.186 17.1219 27.5208 17.832 27.5903H17.8427C18.5488 27.5607 19.2162 27.2562 19.7053 26.7406C20.1945 26.2249 20.4677 25.538 20.4676 24.8235L20.4655 24.7022V24.7087L20.4697 24.5635C20.4697 23.0793 19.3105 21.8703 17.8577 21.814H17.8534L17.8427 21.8183ZM45 5.356V52C38.5225 46.2107 40.5924 48.1282 33.0691 41.054L34.4319 45.864H5.27118C3.87217 45.86 2.53178 45.2954 1.54374 44.2939C0.555687 43.2923 0.00056146 41.9356 0 40.521V5.343C-5.63558e-06 3.92857 0.554644 2.57185 1.54235 1.57028C2.53006 0.568709 3.87022 0.004015 5.26903 0L39.7267 0C41.1257 0.00401383 42.4661 0.568638 43.4541 1.57015C44.4422 2.57166 44.9973 3.92837 44.9979 5.343L45 5.356ZM37.6718 30.004C37.5948 24.6591 36.2968 19.4047 33.8791 14.651L33.9691 14.846C31.9097 13.2019 29.3944 12.2484 26.7737 12.1182L26.7437 12.116L26.3837 12.532C28.8479 13.208 30.9907 14.3455 32.8163 15.8578L32.7863 15.834C29.6046 14.0855 26.0388 13.1749 22.4175 13.1863C19.2184 13.1863 16.1799 13.8818 13.4415 15.132L13.5786 15.0757C12.6273 15.5177 12.0616 15.834 12.0616 15.834C14.0059 14.2316 16.2729 13.078 18.7041 12.454L18.8241 12.428L18.567 12.116C15.9254 12.2447 13.3898 13.2061 11.3159 14.8655L11.3416 14.846C9.08742 19.2573 7.72892 24.4595 7.63892 29.9737V30.004C8.52714 31.2638 9.7083 32.2833 11.0782 32.9725C12.4481 33.6617 13.9647 33.9995 15.4943 33.956H15.4814C15.4814 33.956 16.4328 32.786 17.2042 31.798C15.4063 31.3364 13.8218 30.2601 12.7194 28.7517L12.7044 28.73C13.0815 28.9987 13.7072 29.3453 13.7543 29.38C16.5036 30.907 19.5915 31.7026 22.7282 31.6918C25.1991 31.6949 27.6461 31.203 29.9279 30.2445L29.8036 30.29C30.935 29.8523 31.9078 29.3367 32.812 28.7235L32.7584 28.7582C31.6283 30.2949 30.0037 31.3851 28.1644 31.8413L28.1087 31.8522C28.8801 32.8402 29.8057 33.9582 29.8057 33.9582L30.0436 33.9603C31.5292 33.9617 32.9939 33.6063 34.3171 32.9234C35.6403 32.2405 36.7842 31.2495 37.6546 30.0322L37.6718 30.004Z" fill="white"/>
                </svg>
            </a>
        </div>
    </div>
</footer>
</body>
<script type="text/javascript">
    var profile_button = document.getElementById("profile");
    var subtable_content = document.getElementById("subtable");

    $(profile_button).on('click', e => {
        if ($(subtable_content).hasClass("hidden")){
            $(subtable_content).removeClass("hidden");
        } else {
            $(subtable_content).addClass("hidden");
        }
    })
</script>
</html>
